In [1]:
import pandas as pd

In [2]:
friend_list = [
    ['name',['John','Nate','Julia']],
    ['age',[20, 30, 30]],
    ['job',['student','teacher','dentist']]
]

In [4]:
df = pd.DataFrame.from_items(friend_list)

In [5]:
df

    name  age      job
0   John   20  student
1   Nate   30  teacher
2  Julia   30  dentist

## 1, 2번 연속적인 인덱스의 Row 출력

In [11]:
df[1:3]

    name  age      job
1   Nate   30  teacher
2  Julia   30  dentist

## 이산적인 인덱스의 Row 출력

In [10]:
df.loc[ [0,2] ]

    name  age      job
0   John   20  student
2  Julia   30  dentist

### by column condition

In [12]:
df[df.age > 25]

    name  age      job
1   Nate   30  teacher
2  Julia   30  dentist

In [13]:
df.query('age>25')

    name  age      job
1   Nate   30  teacher
2  Julia   30  dentist

In [16]:
df[ (df.age > 25) & (df.name == 'Nate')] # and로 묶으면 에러발생

   name  age      job
1  Nate   30  teacher

## Filter Column

### by index

In [17]:
friend_list =[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',20,'teacher'],
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  20    teacher

In [19]:
df.iloc[:,:2] # Row, Column

       0   1
0   John  20
1  Jenny  30
2   Nate  20

### by column name

In [25]:
df = pd.read_csv('data/friend_list_no_head.csv', header =None, names = ['name','age','job'])

In [26]:
df

    name  age        job
0  ﻿john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [27]:
df_filtered = df[['name','age']]

In [28]:
df_filtered

    name  age
0  ﻿john   20
1  jenny   30
2   nate   30
3  julia   40
4  Brian   45
5  Chris   25

In [29]:
df.filter(items = ['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [33]:
df.filter(like ='a',axis =1)

    name  age
0  ﻿john   20
1  jenny   30
2   nate   30
3  julia   40
4  Brian   45
5  Chris   25

#### 정규식 이용

In [34]:
df.filter(regex='b$',axis =1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [35]:
df.filter(regex='e$',axis =1)

    name  age
0  ﻿john   20
1  jenny   30
2   nate   30
3  julia   40
4  Brian   45
5  Chris   25

In [37]:
df.filter(regex='b$',axis =1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern